[
  {
    "organization": "JPMorgan Chase & Co.",
    "eventName": "2023 JP Morgan Asset & Wealth Management GFG Asia MBA Summer Associate Info Session",
    "day": "Thu",
    "date": "November 17, 2022",
    "time": "17: 00 - 18: 00 EST",
    "mode": "In person",
    "eventDescription": "This session will be led fully in Mandarin and is for 1st Year MBA students Learn about the MBA Summer Associate program in the Global Families Group, Asia Team!     Join us virtually to learn about MBA summer internship opportunities at J.P. Morgan in the Global Private Bank, Global Families Group, Asia.      The Global Families Group works exclusively with international individuals and families who have investments, business interests and family circumstances across the United States and the Asia Pacific region. You’ll hear from some of our Senior Leaders as we will cover topics the Summer Associate Program, J.P. Morgan, and more!",
    "aboutEmployer": "JPMorgan Chase (NYSE: JPM) is one of the oldest financial institutions in the United States. With a history dating back over 200 years, here's where we stand today:     We are a leading global financial services firm with assets of $2.4 trillion.     We operate in more than 60 countries.     We have over 240,000 employees.     We serve millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients.",
    " previousEvents": "August 2022, April 2021, March 2020",
    "Email": "brian.j.marchiony@jpmorgan.com",
    "Twitter": "https://twitter.com/Chase",
    "Facebook": "https://www.facebook.com/jpmorganchase",
    "LinkedIn": "https://www.linkedin.com/company/jpmorganchase/"
  },
  {
    "organization": "Capital One",
    "eventName": "Capital One Students & Grads Virtual Event: Fireside Chat with Annie Fallows",
    "day": "Thu",
    "date": "November 17, 2022",
    "time": "17: 00 - 18: 00 EST",
    "mode": "Virtual",
    "eventDescription": "Join Capital One for a virtual Fireside Chat with Annie Fallows, former Capital One intern and current Senior Vice President.      During this chat, Annie will share her career journey and how creating a culture of growth and belonging starts with asking questions and open communication. There will be an opportunity for audience questions as well so this is an event you won't want to miss!",
    "aboutEmployer": "Our rotational programs introduce you to the working world with hands-on experience, mentorship and real impact. You can explore and contribute to your own success and ours. Plus, the opportunities here are almost endless. That’s life at Capital One.",
    "previousEvents": "May 2021, October 2020",
    "Email": "careers@capitalone.com",
    "Twitter": "https://twitter.com/capitalonejobs",
    "Facebook": "https://www.facebook.com/CapitalOneCareers/",
    "LinkedIn": "https://www.linkedin.com/company/capital-one/"
  },
  {
    "organization": "Amazon",
    "eventName": "Navigating a career in Amazon as a first-gen",
    "day": "Thu",
    "date": "November 7, 2022",
    "time": "18: 00 - 19: 00 EST",
    "mode": "Virtual",
    "eventDescription": "In honor of First-Generation College Celebration Day (https://bit.ly/3gzSHjt), Amazonians will cover how they have navigated their career path. This will be an engaging session where your submitted question could be selected for the panel as a first-generation prospective candidate.",
    "aboutEmployer": "Earth's most customer-centric company     When Amazon.com launched in 1995, it was with the mission “to be Earth’s most customer-centric company, where customers can find and discover anything they might want to buy online, and endeavors to offer its customers the lowest possible prices.” This goal continues today, but Amazon’s customers are worldwide now, and have grown to include millions of Consumers, Sellers, Content Creators, and Developers & Enterprises. Each of these groups has different needs, and we always work to meet those needs, innovating new solutions to make things easier, faster, better, and more cost-effective.",
    " previousEvents": "October 2021, March 2021",
    "Email": "universityrecruiting@amazon.com",
    "Twitter": "https://twitter.com/amazonnews",
    "Facebook": "https://www.facebook.com/InsideAmazon/",
    "LinkedIn": "https://www.linkedin.com/company/amazon/"
  },
  {
    "organization": "Virginia Tech",
    "eventName": "CEIP: INFORMATION Session for the Co-op/Internship Program",
    "day": "Mon",
    "date": "November 14, 2022",
    "time": "12: 30 - 13: 45 EST",
    "mode": "Virtual",
    "eventDescription": "*REQUIRED for Winter or Spring 2023 enrollment. This session will provide information for undergraduate students who are interested in the formal Cooperative Education and Internship Program (CEIP). Students will learn about different employment and enrollment options as well as the benefits and requirements of the program",
    "aboutEmployer": "Virginia Tech is a public land-grant research university with its main campus in Blacksburg, Virginia. Virginia Tech offers 280 undergraduate and graduate degree programs to some 34,400 students. It manages a research portfolio of $522 million, placing it among the top 50 universities in the U.S. for total research expenditures, top 25 in computer and information sciences and top 10 in engineering, with the latter two the highest rankings in the state",
    " previousEvents": "January 2020, November 2020",
    "Email": "cpd@vt.edu",
    "Twitter": "https://twitter.com/virginia_tech?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor",
    "Facebook": "https://www.facebook.com/virginiatech/",
    "LinkedIn": "https://www.linkedin.com/school/virginia-tech/"
  },
  {
    "organization": "Nike",
    "eventName": "Nike Virtual Swoosh Day - Connected Membership Graduate Internship Info-Session",
    "day": "Tue",
    "date": "November 08, 2022",
    "time": "17: 30 - 18: 45 EST",
    "mode": "Virtual",
    "eventDescription": "This Nike info-session is best suited for current first year MBA students.      Join us for an amazing opportunity to learn about the Nike Internship Program, and what makes Connected Membership an exciting career path at Nike! The session will feature a panel of Nike teammates who will share their Nike journeys, talk about the specifics of the Connected Membership Internship Program, opportunities for full time roles at Nike after graduation, and give you advice on how to shine in the recruitment process and beyond. You will be able to ask the panel questions in open Q&A. So throw on your favorite kicks (it doesn't matter that we'll be on Zoom!) and pull up on us! We're excited to meet you!",
    "aboutEmployer": "NIKE, Inc. is the world’s leading designer, marketer and distributor of authentic athletic footwear, apparel, equipment and accessories for a wide variety of sports and fitness activities.      At Nike we see a world where everybody is an athlete—united in the joy of movement. Driven by our passion for sport and our instinct for innovation, we aim to elevate human potential. Whether our job is designing the ultimate sneaker or coding a revolutionary app, we’re united by the same mission: to bring inspiration and innovation to every athlete in the world. That means you. Because, as Bill Bowerman—Nike’s co-founder and legendary coach—once said, “If you have a body, you are an athlete.” Every day, we demand a better future for ourselves, our athletes, and our communities. We believe that diversity fosters creativity and accelerates innovation. We believe in protecting a planet where all athletes can thrive. And we believe every kid, everywhere, should have access to sport.",
    " previousEvents": "March 2021, April 2020",
    "Email": "universityrelations@nike.com",
    "Twitter": "https://twitter.com/nike",
    "Facebook": "https://www.facebook.com/nike/?ref=br_rs",
    "LinkedIn": "https://www.linkedin.com/company/nike/"
  },
  {
    "organization": "Bank of America",
    "eventName": "Better Money Habits Budgeting & Savings",
    "day": "Tue",
    "date": "November 15, 2022",
    "time": "17: 00 - 18: 00 EST",
    "mode": "Virtual",
    "eventDescription": "THave you ever wondered if you could improve your financial wellbeing? If you want to learn more about how you can make a budget & better savings habits, please join Bank of America as we give professional advice on becoming more financially fit. This is a complimentary virtual interactive event hosted by Bank of America on Tuesday, November 15th from 5-6pm EST on WebEx. All undergraduate and graduate students are welcome to attend. Please join our Better Money Habits Webinar via the Webex link five minutes before the start time. If you have any questions please reach out to us_campus@bofa.com.",
    "aboutEmployer": "Bank of America is one of the world's leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 66 million consumer and small business relationships with approximately 4,400 retail financial centers, over 16,000 ATMs, and award-winning online banking with approximately 36 million active accounts and more than 26 million mobile active users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 3 million small business owners through a suite of innovative, easy-to-use online products and services. The company serves clients through operations in all 50 states, the District of Columbia, the U.S. Virgin Islands, Puerto Rico and more than 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange.",
    " previousEvents": "January 2021",
    "Email": " us_campus@bankofamerica.com",
    "Twitter": "https://twitter.com/BofA_Careers",
    "Facebook": "https://www.facebook.com/BankofAmerica",
    "LinkedIn": "https://www.linkedin.com/company/bank-of-america/careers/"
  },
  {
    "organization": "General Electric",
    "eventName": "GE Research Grad Student Info-Session",
    "day": "Wed",
    "date": "November 09, 2022",
    "time": "16: 00 - 17: 00 EST",
    "mode": "Virtual",
    "eventDescription": "During this interactive info session, you’ll get an inside look at how GE researchers and scientists deliver groundbreaking technologies that are working to advance precision health, accelerate the energy transition, and define the future of flight.      You will learn about career opportunities for graduate students. We are on the threshold of an exciting new chapter of innovation! GE Research will transform into three, advanced co-located research centers healthcare, energy, and aviation.          GE HealthCare Research Focus:     MR: plug-n-play & compact 7T     Ultrasound: wireless & handheld     Bioelectronic medicine     CT: photon counting     5G Testbed          GE Vernova Research Focus:     Direct Air Capture     100 % H2 Combustion     Next Gen Nuclear     Carbon Capture & Sequestration     Digital Ghost OT Cybersecurity     Superconducting Generator          GE Aviation Research Focus:     RISE     Hybrid electric flight     AI-based inspection     H2 powered flight     Sustainable aviation fuels     Hypersonic materials & propulsion          We’re multiplying Edison’s legacy X3 !          We have research career opportunities for graduate students in engineering and computer science, including our award-winning internship program, the Technical Research Edison Rotational Program, a premier rotational program for Masters graduates in engineering and computer science and other early career, full time roles.          ﻿Join us to learn how you can impact the world when you join GE Research!",
    "aboutEmployer": "GE rises to the challenge of building a world that works. For more than 125 years, GE has invented the future of industry, and today the company’s dedicated team, leading technology, and global reach and capabilities help the world work more efficiently, reliably, and safely. GE’s people are diverse and dedicated, operating with the highest level of integrity and focus to fulfill GE’s mission and deliver for its customers. www.ge.com      GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.",
    " previousEvents": "March 2021",
    "Email": " university.recruiting@ge.com",
    "Twitter": "https://twitter.com/generalelectric",
    "Facebook": "https://www.facebook.com/GE/",
    "LinkedIn": "https://twitter.com/generalelectric"
  },
  {
    "organization": "Google",
    "eventName": "Google Presents: Inside Google: Women In Tech",
    "day": "Tue",
    "date": "November 08, 2022",
    "time": "16: 00 - 16: 45 EST",
    "mode": "Virtual",
    "eventDescription": "If you’re interested in learning more about technical opportunities for women at Google, tune in to our panel of women Googlers as they reflect on their journeys and experiences navigating the tech industry.      Spanning an array of intersectional identities, tenures, product areas and working styles, this group will discuss how they build and leverage community to foster an inclusive environment for all.          We encourage you to join us live to have your questions answered by Googlers and connect with peers through the chat box! While this event is centered around the experiences of women in tech at Google, all are welcome to join in the conversation as we continue to work together to Build for Everyone.          Register for the event and watch here: https://goo.gle/3eIDOLj",
    "aboutEmployer": "Google is not a conventional company, and we don’t intend to become one. True, we share attributes with the world’s most successful organizations – a focus on innovation and smart business practices comes to mind – but even as we continue to grow, we’re committed to retaining a small-company feel. At Google, we know that every employee has something important to say, and that every employee is integral to our success. We provide individually-tailored compensation packages that can be comprised of competitive salary, bonus, and equity components, along with the opportunity to earn further financial bonuses and rewards.",
    " previousEvents": "February 2021",
    "Email": " studentcareers@google.com",
    "Twitter": "https://twitter.com/lifeatgoogle",
    "Facebook": "https://www.facebook.com/lifeatgoogle",
    "LinkedIn": "https://www.linkedin.com/company/google/"
  }
]
